---
kind: property
id: P:Autodesk.Revit.DB.BaseExportOptions.HatchPatternsFileName
source: html/25578983-c9f4-0e2b-29dd-c0a58fb89b08.htm
---
# Autodesk.Revit.DB.BaseExportOptions.HatchPatternsFileName Property

Custom hatch patterns (pat) file name.

## Syntax (C#)
```csharp
public string HatchPatternsFileName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null